#-*- coding:UTF-8 -*-
BASE = '.\\data\\'
BASE_DIR = 'data'
STOCK_DIR, INDEX_DIR, MODEL_DIR, SCALER_DIR, BIN_DIR, GLOBAL_DIR, TMP_DIR = 'stock', 'index', 'model', 'scaler', 'bins', 'global', 'temp'

STOCK_DATE_DELTA = 10000
IS_PRINT_TUSHARE_CALL_INFO = True
CONTINUOUS_DAYS = 15
NUM_CLASSES = 6  # 减少类别数量以改善类别平衡

#BANK_CODE_LIST = ['000001.SZ']#, '601288.SH', '601939.SH', '601988.SH', '601328.SH']
BANK_CODE_LIST = ['000001.SZ', '002142.SZ', '002807.SZ', '002839.SZ', '002936.SZ', '002948.SZ', '002958.SZ', '002966.SZ', '600000.SH', '600015.SH', '600016.SH', '600908.SH', '600919.SH', '600926.SH', '600928.SH', '601009.SH', '601077.SH', '601128.SH', '601166.SH', '601169.SH', '601229.SH', '601288.SH', '601328.SH', '601398.SH', '601577.SH', '601658.SH', '601818.SH', '601838.SH', '601860.SH', '601916.SH', '601939.SH', '601988.SH', '601997.SH', '601998.SH', '603323.SH']
STOCK_CODE_LIST = []#['000776.SZ','600030.SH','600999.SH']
INSURANCE_CODE_LIST = []#['601318.SH','601601.SH','601628.SH']
OTHERS_CODE_LIST = []#['601398.SH', '601288.SH', '601939.SH', '600519.SH', '601988.SH', '601857.SH', '601628.SH', '601318.SH', '002594.SZ', '601088.SH', '600028.SH', '600900.SH', '601328.SH', '601899.SH', '000333.SZ', '000858.SZ', '601166.SH', '600030.SH', '601998.SH', '600276.SH', '600000.SH', '601601.SH', '601211.SH', '002475.SZ', '002714.SZ', '002415.SZ', '002371.SZ', '000651.SZ', '603993.SH', '600809.SH', '601919.SH', '600690.SH', '002352.SZ', '603288.SH', '000001.SZ', '601668.SH', '601818.SH', '600104.SH', '601766.SH', '601633.SH', '601127.SH', '600309.SH', '000063.SZ', '601225.SH', '600016.SH', '601336.SH', '600919.SH', '601881.SH']
ALL_CODE_LIST = BANK_CODE_LIST + STOCK_CODE_LIST + INSURANCE_CODE_LIST + OTHERS_CODE_LIST
TEST_DATA_CNT = 50
T1L_SCALE = [-0.03, -0.02, -0.01, -0.005,    0]
T2H_SCALE = [    0, 0.005,  0.01,   0.02, 0.03]
INDUSTRY_LIST = ['电气设备', '元器件', '软件服务', '专用机械', '化工原料', '汽车配件', '半导体', '医疗保健', '化学制药', '通信设备', '建筑工程', '机械基件', '环境保护', '电器仪表', '食品', '家用电器', '互联网', '塑料', 'IT设备', '生物制药', '中成药', '家居用品', '服饰', '小金属', '农药化肥', '广告包装', '航空', '文教休闲', '证券', '运输设备', '区域地产', '仓储物流', '供气供热', '农业综合', '银行', '纺织', '工程机械', '影视音像', '医药商业', '矿物制品', '百货', '染料涂料', '造纸', '化纤', '铝', '火力发电', '其他建材', '出版业', '新型电力', '装修装饰', '全国地产', '普钢', '煤炭开采', '机床制造', '多元金融', '饲料', '水泥', '钢加工', '汽车整车', '水力发电', '石油开采', '乳制品', '日用化工', '白酒', '综合类', '种植业', '水运', '路桥', '铜', '玻璃', '商贸代理', '旅游景点', '橡胶', '港口', '水务', '园区开发', '石油加工', '铅锌', '农用机械', '化工机械', '房产服务', '其他商业', '摩托车', '船舶', '纺织机械', '特种钢', '汽车服务', '黄金', '软饮料', '酒店餐饮', '红黄酒', '啤酒', '空运', '超市连锁', '渔业', '铁路', '轻工机械', '旅游服务', '焦炭加工', '公共交通', '保险', '陶瓷', '批发业', '机场', '电信运营', '石油贸易', '商品城', '林业', '公路', '电器连锁']
#以下为已弃用的参数
NAN_FILL = -1
PREDICT_CNT = 3
LATEST_DATE = 20170615
STANDARD_DATE = 20250827
MIN_TOTAL_MV = 3000000
T1_LOWER, T1_UPPER, T2_LOWER, T2_UPPER = 0.0, 0.005, 0.015, 0.025
#****num_classes_4_here********************
#NUM_CLASSES = 4
#T1L_TV  = [-2.5,   -1 , -0.15]
#T2L_TV  = [-3,   -1.1 , -0.5 ]
#T3L_TV  = [-3.6, -1.15,  1   ]
#T1H_TV  = [0.15,    1 ,  2.5 ]
#T2H_TV  = [-0.5,  1.1 ,  3.3 ]
#T3H_TV  = [-1.5,  1,     4   ]
#***************************************

#****num_classes_5_here********************
#NUM_CLASSES = 5
#T1L_TV  = [-2.5 , -1.35, -0.7,  0  ]
#T2L_TV  = [-2.55, -1.19,    0,  1  ]
#T3L_TV  = [-3.2 , -1.45,    0,  1.5]
#T1H_TV  = [   0 ,  0.65,  1.4,  2.9]
#T2H_TV  = [  -1 ,     0,  1.2,  2.8]
#T3H_TV  = [-1.35,     0, 1.44,  3.5]
#***************************************

#****num_classes_10_here********************
#NUM_CLASSES = 10
#			0     1     2     3     4     5      6     7    8
#T1L_TV  = [-5  , -3  , -2  , -1.5, -1  , -0.7 , -0.4 , 0  , 0.5]
#T2L_TV  = [-7  , -5  , -3  , -2  , -1.3, -0.7 ,    0 , 1  , 3  ]
#T3L_TV  = [-8  , -4.5, -3  , -2  , -1  ,  0   ,    1 , 2.5, 5  ]
#T1H_TV  = [-1  ,  0  ,  0.3,  0.6,  1  ,  1.5 ,    2 , 3  , 6  ]
#T2H_TV  = [-3  , -1  ,  0  ,  0.6,  1.2,  1.8 ,  2.6 , 4  , 8  ]
#T3H_TV  = [-5  , -2  , -0.9,  0  ,  0.8,  1.7 ,    3 , 5  , 10 ]
#***************************************
BIG_INCREASE_THRESHOLD = 3
BIG_DROP_THRESHOLD = -3
BIG_CODE_LIST = []#['399001.SZ', '000001.SH']
